Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Thus, the locally configured securityName is entirely trusted within the notification originator.
ja: したがって, ローカルに設定された securityName が 通知の発信者が完全に信頼される.

source: Rekeying
ja: 鍵の再生成

source: The server should thus arrange to erase this from memory as soon as it is no longer required.
ja: サーバは, 必要でなくなったらすぐにメモリーからRSA秘密鍵を消す用意をする必要がある.

source: The security threats and how the SSH Transport Model mitigates those threats is covered in detail throughout this memo.
ja: セキュリティの脅威と SSH トランスポートモデルがそれらの脅威をどのように軽減するかは, このメモ全体を通して詳細に記述されている.

source: Additional 'signal name' values MAY be sent in the format "sig-name@xyz", where "sig-name" and "xyz" may be anything a particular implementer wants (except the "@" sign).
ja: 追加の 'signal name' の値が, フォーマット "sig-name@xyz" で送られてもよい. ここで "sig-name" と "xyz" は, ("@" を除く)実装者が望むどんな文字列でもよい.

source: Both of these describe the CBC mode of operation of certain ciphers and the weakness of this scheme.
ja: これらはともに, 特定の暗号を利用するCBCモードとこの方式の弱点を記述している.

source: This section formally describes the method of generating public key fingerprints that is in common use in the SSH community.
ja: この節では, SSHコミュミティで共通に利用する公開鍵の指紋を生成する方法を記述する.

source: If the 'want_reply' boolean is set, the server MUST reply using an SSH_MSG_CHANNEL_SUCCESS or SSH_MSG_CHANNEL_FAILURE [5] message.
ja: 'want_reply' が設定されていたら, サーバは SSH_MSG_CHANNEL_SUCCESS か SSH_MSG_CHANNEL_FAILURE [5] メッセージを用いて応答しなければならない.

source: If there is no such algorithm, both sides MUST disconnect.
ja: そのようなアルゴリズムがなければ, 両方の側が切断しなければならない.

source: For example, a client that supports key exchange using the Kerberos V5 GSS-API mechanism [KRB5-GSS] only underneath SPNEGO will not interoperate with a server that supports key exchange only using the Kerberos V5 GSS-API mechanism directly.
ja: たとえば, SPENGO の下で Kerberos V5 GSS-API メカニズム [KRB5-GSS] を用いる鍵交換をサポートするクライアントは,Kerberos V5 GSS-API を直接用いる鍵交換のみをサポートするサーバと, 相互運用できない.

source: Implementation of larger values is encouraged whenever possible.
ja: 可能な限り大きな値で実装することが推奨される.

source: Conventions .........................................7 4.2.2.
ja: 規約 .........................................7 4.2.2.

source: Verify HMAC.
ja: HMACの検証.

source: In SSH, the key exchange is signed with the host key to provide host authentication.
ja: SSHでは, 鍵交換は, ホスト認証を提供するホスト鍵で署名されている.

source: Any non-authentication messages sent by the client after the request that resulted in SSH_MSG_USERAUTH_SUCCESS being sent MUST be passed to the service being run on top of this protocol.
ja: SSH_MSG_USERAUTH_SUCCESS が送られた要求のあとでクライアントから送られる認証には関係のないメッセージは, このプロトコルの上で動作するサービスに渡されなければならない.

source: Second SSH_MSG_USERAUTH_REQUEST Message
ja: 2 番目の SSH_MSG_USERAUTH_REQUEST メッセージ

source: Following the last "publickey" response, a status packet MUST be sent.
ja: 最後の "publickey" 応答に続いて, 状態パケットが送られなければならない.

source: In the optimal case, an implementer would need to add an extra packet only if the packet has been sent out onto the network and there are no other packets waiting for transmission.
ja: もっともよい対処法が, パケットがネットワーク上に送信されさらなる転送パケットがない場合に, 実装者は別のパケットを追加することだろう.

source: Determine the tmTransportAddress to be associated with the incoming message:
ja: 受信メッセージに関連する tmTransportAddress を決定する.

source: Adding a Public Key
ja: 公開鍵の追加

source: (This is the same data that is base64 encoded to form the body of the public key file.)
ja: (公開鍵ファイルの本体を構成するために base64 エンコードされるデータと同じものだ.)

source: If a server receives a request for this method when initial key exchange was not performed using a GSS-API-based key exchange method defined in accordance with Section 2, it MUST return SSH_MSG_USERAUTH_FAILURE.
ja: 2 節に従って定義された GSS-API ベースの鍵交換法を用いずに最初の鍵交換が行なわれた際に この認証法の要求をサーバが受け取ったら, SSH_MSG_USERAUTH_FAILURE を返さなければならない.

source: SSHv2 provides perfect forward secrecy (PFS) for encryption keys.
ja: SSHv2は、暗号鍵に対する完全転送秘密（PFS）を提供する.

source: MAC Algorithm Name Reference ------------------ --------- hmac-sha1 [SSH-TRANS, Section 6.4] hmac-sha1-96 [SSH-TRANS, Section 6.4] hmac-md5 [SSH-TRANS, Section 6.4] hmac-md5-96 [SSH-TRANS, Section 6.4] none [SSH-TRANS, Section 6.4]
ja: MAC アルゴリズム名 Reference ------------------ --------- hmac-sha1 [SSH-TRANS, Section 6.4] hmac-sha1-96 [SSH-TRANS, Section 6.4] hmac-md5 [SSH-TRANS, Section 6.4] hmac-md5-96 [SSH-TRANS, Section 6.4] none [SSH-TRANS, Section 6.4]

source: Key Exchange Method Names
ja: 鍵交換法の名前

source: Key Exchange Messages ..........................................13 7.1.
ja: 鍵交換のメッセージ ..........................................13 7.1.

source: To prevent this, implementers are encouraged to utilize commonly accepted MAC algorithms, and administrators are encouraged to watch current literature and discussions of cryptography to ensure that they are not using a MAC algorithm that has a recently found vulnerability or weakness.
ja: これを防ぐため, 実装者には, 一般に受け入れられているMACアルゴリズムを利用することが推奨される. また, 管理者には, 最近脆弱性や弱点が見つかったMACアルゴリズムを利用しないことを保証するために, 暗号学の最近の文献や議論を監視することが推奨される.

source: This protocol is intended to be used from the Secure Shell Connection Protocol [4] as a subsystem, as described in the section "Starting a Shell or a Command".
ja: このプロトコルは, セキュアシェルコネクションプロトコル [4] の, "「シェルまたはコマンドの開始」 節に記述されている, サブシステムから利用されることを意図している.

source: When no OCSP responses are provided, it is up to the implementation and system administrator to decide whether or not to accept the certificate.
ja: OCSP 応答が提供されない場合, 証明書を受け入れるかどうかの決定は実装とシステム管理者次第だ.

source: Information on the REQUIRED and RECOMMENDED sets of elliptic curve domain parameters for use with this algorithm can be found in Section 10.
ja: このアルゴリズムと共に用いる楕円曲線ドメインパラメータの要求されている集合と推奨される集合の情報は, 10節で示す.

source: The order of the subgroup generated by 2 is q = p - 1.
ja: 2で生成された部分群のオーダーは q = p -1 だ.

source: If the request is not recognized or is not supported for the channel, SSH_MSG_CHANNEL_FAILURE is returned.
ja: 要求が理解できなかったりチャンネルでサポートされていない場合は, SSH_MSG_CHANNEL_FAILURE を返す.

source: If the order is p - 1, then the exponents generate all possible public values, evenly distributed throughout the range of the modulus p, without cycling through a smaller subset.
ja: オーダーが p - 1 のとき, 指数は, pの法の範囲を均等に分布し小さいサブセットを巡回することがない, 可能なすべての公開値を生成する.

source: These bytes will always be:
ja: このバイト列は常に以下だ:

source: Chunked Framing Mechanism
ja: チャンクされたフレーミングメカニズム

source: These measures may include dedicated management-only networks, point-to-point links, and the ability to use alternate protocols and transports.
ja: この軽減策には, 専用の管理専用のネットワーク, ポイント-トゥ-ポイントのリンク, 代替のプロトコルやトランスポートを利用する能力が含まれるだろう.

source: The exchange hash H from the first key exchange is additionally used as the session identifier, which is a unique identifier for this connection.
ja: 最初の鍵交換からの交換ハッシュ H は, 接続の唯一の識別子として, セッション識別子(session_id)としても使われる.

source: In this document, we shall focus on AES GCM, the use of the Advanced Encryption Algorithm (AES) in Galois Counter Mode.
ja: この文書では, Galois カウンタモードを Advanced Encryption Algorithm (AES) と用いる場合である, AES GCM に焦点を当てる.

source: No response is sent to this message.
ja: このメッセージには応答は送られない.

source: If the first and last characters of the Header-value are matching quotation marks, implementations SHOULD remove them before using the value.
ja: Header-value の 最初と最後の文字が引用符と一致するなら, 値を利用する前に引用符を実装は除く必要がある.

source: It is a site policy decision for the server whether or not to permit authentication using GSS-API mechanisms and/or contexts that do not support per-message integrity protection.
ja: メッセージ単位の完全性保護をサポートしないGSS-APIメカニズム と/もしくは コンテクスト を利用する認証を許可するかどうかは, サーバのサイトポリシーの問題だ.

source: Since there is no way with current DNS lookup APIs to tell whether a search path is from a trusted source, the entire client system would need to be configured with this trusted DNS search path.
ja: どのサーチパスが信頼できるソースから得られたものかわかる ＤＮＳ 検索 API は現在ないので, クライアントシステム全体が信頼できるDNSサーチパスによって設定されている必要があるだろう.

source: The following conditions must be met:
ja: 以下の条件を満たす必要がある:

source: This is due to the use of implicit server authentication in this key exchange method.
ja: これは, この鍵交換法で暗黙的なサーバ認証を利用するためだ.

source: If the other party's guess was wrong, and this field was TRUE, the next packet MUST be silently ignored, and both sides MUST then act as determined by the negotiated key exchange method.
ja: 相手側の推測が間違っていてこのフィールドがTRUEなら, 次のパケットは静かに無視されなければならない. そして, 両方の側は取り決められた鍵交換法によって決められた行動をしなければならない.

source: Named Elliptic Curve Domain Parameters ........................16 10.1.
ja: 指定された楕円曲線ドメインパラメータ ........................16 10.1.

source: Clients SHOULD correctly echo/mask user input for each prompt independently of other prompts in the request message.
ja: クライアントは, 要求メッセージの中のpromptoごとに独立に正確にユーザの入力をエコー/マスクする必要がある.

source: All clients MUST properly handle an instruction field with embedded newlines.
ja: すべてのクライアントは, 改行を含む instruction フィールドを適切に扱えなければならない.

source: "ssh" as the corresponding prefix for the snmpSSHDomain in the SNMP Transport Domains registry; defined in [RFC5590].
ja: [RFC5590] で定義された SNMP Transport Domains レジストリ で snmpSSHDomein に対応するプレフィックス "ssh".

source: The size of transient key used should be sufficient to protect the encryption and integrity keys generated by the key-exchange method.
ja: 利用される一時鍵のサイズは, 鍵交換法によって生成される暗号化と完全性保護の鍵を保護するのに十分な必要がある.

source: Future Assignments ..................................8 4.3.
ja: 将来の割り当て..................................8 4.3.

source: The header data allowed by this file format could contain an unlimited range of information.
ja: このファイル形式で利用できるヘッダのデータは, 情報の範囲の制限がない.

source: Future Assignments
ja: 将来の割り当て

source: X11 connection forwarding should stop when the session channel is closed.
ja: X11 接続の転送は, セッションのチャンネルが終了したら停止されるべきだ.

source: Table 1.
ja: 表 1.

source: The NETCONF protocol [RFC6241] is an XML-based protocol used to manage the configuration of networking equipment.
ja: NETCONF プロトコル [RFC6241] は, ネットワーク機器の設定を管理するのに使われる XML ベースのプロトコルだ.

source: The method described here can provide out-of-band verification by looking up a fingerprint of the server public key in the DNS [1][2] and using DNSSEC [5] to verify the lookup.
ja: ここに記述する方法は, DNS[1][2]でサーバの指紋を検索しその検索を DNSSEC [5] で保証する, SSHの通信の外側での検証を提供する.

source: X.509 public key certificates use a signature by a trusted certification authority to bind a given public key to a given digital identity.
ja: X.509 公開鍵証明書は, 公開鍵を電子IDに束縛するため信頼される認証局による署名を用いる.

source: Compression and encryption contexts are reset.
ja: 圧縮と暗号化のコンテキストはリセットされる.

source: The client MUST receive acknowledgement of each request prior to sending a new request.
ja: クライアントは, 新しい要求を送る前にそれぞれの要求の確認応答(状態メッセージ)を受け取らなければならない.

source: The identity of the SSH server MUST be verified and authenticated by the SSH client according to local policy before password-based authentication data or any configuration or state data is sent to or received from the SSH server.
ja: SSH サーバの識別情報は, パスワードベースの認証データや設定や状態のデータを SSH サーバに送ったり SSH サーバから受け取ったりする前に, ローカルなポリシーに基づいて SSH クライアントが検証し認証されなければならない.

source: The client is allowed to send further messages without waiting for the response to the request.
ja: クライアントは, リクエストに対する返答を待つことなくさらなるメッセージを送ってもよい.

source: A name MUST have a non-zero length, and it MUST NOT contain a comma (",").
ja: name は 0でない長さでなければならない. また, カンマ (",") を含んではならない.

source: subject defined in Section 3.3.1
ja: subject は 3.3.1 節で定義されている

source: All ciphers SHOULD use keys with an effective key length of 128 bits or more.
ja: すべての暗号は, 128bit以上の有効な鍵長を持つ鍵を使う必要がある.

source: Table 2.
ja: 表 2.

source: The "pgp-sign-rsa" method indicates the certificates, the public key, and the signature are in OpenPGP compatible binary format ([RFC2440]).
ja: "pgp-sign-rsa" 法は, OpenPGP 互換バイナリフォーマット ([RFC2440]) による証明書と公開鍵, 署名を示している

source: The client will then invoke the "ssh-userauth" service to authenticate the user, as described in the SSH authentication protocol [RFC4252].
ja: クライアントは SSH 認証プロトコル [RFC4252] に記述されているようにユーザを認証するため "ssh-userauth" サービスを起動する.

source: The "diffie-hellman-group1-sha1" method specifies the Diffie-Hellman key exchange with SHA-1 as HASH, and Oakley Group 2 [RFC2409] (1024- bit MODP Group).
ja: "diffie-hellman-group1-sha1" 法は, HASH として SHA-1 またOakley Group 2 [RFC2409] (1024-bit MODP Group)を用いる Diffie-Hellman 鍵交換を指定する.

source: All implementations SHOULD provide an option not to accept host keys that cannot be verified.
ja: すべての実装は, 検証できないホスト鍵を受け入れない選択を提供する必要がある.

source: It would be considered good form for an implementation to politely and unobtrusively notify a user that a stronger cipher is available and should be used when a weaker one is actively chosen.
ja: より弱い暗号があえて選択されている場合に, より強い暗号が利用できかつ利用されるべきであることをていねいにでしゃばらずにユーザに知らせるのが, 実装としてよいあり方だろう.

source: User Authentication
ja: ユーザ認証

source: For IP-based networks, it is anticipated that each element of the "from" parameter will take the form of a specific IP address or hostname.
ja: IPベースのネットワークでは, "from" パラメータの要素は, 特定のIPアドレスかホスト名の形式となるのが予想される.

source: This document specifies methods of using the Arcfour cipher in the Secure Shell (SSH) protocol that mitigate the weakness of the cipher's key-scheduling algorithm.
ja: この文書は, セキュア シェル (SSH) プロトコルで Arcfour 暗号を利用する方法を指定する. この方法はArcfourの鍵スケジュールアルゴリズムの弱点を軽減する.

source: The 'public key blob' may contain certificates.
ja: 'public key blob' は, 証明書を含むかもしれない.

source: SHA-1 is described in [FIPS-180-2] and MD5 is described in [RFC1321].
ja: SHA-1 は [FIPS-180-2] に, MD5 は [RFC1321] に記述されている.

source: 5 when p (mod 10) = 3 or 7.
ja: 5 p (mod 10) = 3 or 7 のとき.

source: * The client MUST also include "e" with the first message it sends to the server during this process; if the server receives more than one "e" or none at all, the key exchange fails.
ja: * クライアントは, このプロセスでサーバに送る最初のメッセージに "e" を含めなければならない. サーバが1つより多い"e"を受けとったりまったく受け取らなかったら, 鍵交換は失敗する.

source: Size on a characteristic-2 curve is defined as the number of bits in the binary representation of the field, commonly denoted by m.
ja: characteristic-2 曲線のサイズは, フィールドの2進表現のビット数で定義される. 通常 m で示される.

source: If the value of this attribute is empty, all "direct-tcpip" requests should be refused when using this key.
ja: この属性の値が空なら, この鍵を用いるすべての "direct-tcpip" 要求は拒否される必要がある.

source: For example, public key authentication makes no assumptions about security on the server.
ja: たとえば, 公開鍵認証はサーバのセキュリティについては何ら前提を置かない.

source: As with all specifications involving cryptographic algorithms, the quality of security provided by this specification depends on the strength of the cryptographic algorithms in use, the security of the keys, the correctness of the implementation, and the security of the public key infrastructure and the certificate authorities.
ja: 暗号アルゴリズムを含むすべての仕様と同様に, この仕様で提供されるセキュリティの品質は, 利用する暗号アルゴリズムの強度や, 鍵のセキュリティ, 実装の正しさ, 公開鍵基盤と認証局のセキュリティに依存する.

source: encryption algorithms (both client_to_server and server_to_client) AEAD_AES_128_GCM [SSH-GCM] AEAD_AES_256_GCM [SSH-GCM]
ja: 暗号化アルゴリズム (client_to_server と server_to_client の両方) AEAD_AES_128_GCM [SSH-GCM] AEAD_AES_256_GCM [SSH-GCM]

source: Starting NETCONF over SSH .......................................2 3.1.
ja: SSH 上での NETCONF の起動 .......................................2 3.1.

source: X11 Forwarding
ja: X11 の転送

source: Data transfer for a session is done using SSH_MSG_CHANNEL_DATA and SSH_MSG_CHANNEL_EXTENDED_DATA packets and the window mechanism.
ja: セッションのデータ転送は, SSH_MSG_CHANNEL_DATA とSSH_MSG_CHANNEL_EXTENDED_DATA パケットと ウィンドウメカニズムを用いて行なわれる.

source: The RDATA of the presentation format of the SSHFP resource record consists of two numbers (algorithm and fingerprint type) followed by the fingerprint itself, presented in hex, e.g.:
ja: SSHFP リソースレコードの RDATA の表示形式は次のように構成される. まず, アルゴリズムと指紋の種類を表す2つの番号, 続いて16進文字列で表現された指紋自身が来る. 例えば以下のようになる.

source: A different approach to solve the DNS search path issue would be for clients to use a trusted DNS search path, i.e., one not acquired through DHCP or other autoconfiguration mechanisms.
ja: DNS のサーチパス問題を解決する別のアプローチに, クライアントが信頼できる DNS サーチパス, すなわちDHCPや他の自動設定メカニズムによって得られたものではないもの, を使うことがあるだろう.

source: Note that the 'plaintext password' value is encoded in ISO-10646 UTF-8.
ja: 'plaintext password' の値は, ISO-10646 UTF-8 でエンコードされることに注意.

source: IANA updated these allocations to refer to this document.
ja: IANA はこの文書を差すようにこれらの割り当てを更新した.

source: If the server public keys are not securely distributed, then the client cannot know if it is talking to the intended server.
ja: サーバの公開鍵が安全に配布されないと, クライアントは目的のサーバと接続ているのかどうか知ることができない.

source: How this is accomplished is implementation-dependent.
ja: これをどう達成するかは実装依存だ.

source: An IPv4 address must be in dotted decimal format followed by a colon ':' (US-ASCII character 0x3A) and a decimal port number in US-ASCII.
ja: IPv4 アドレスは, ドット区切りの10進形式で後に コロン ':' (US-ASCII 文字 0x3A) と US-ASCIIの10進のポート番号が続かなければならない.

source: Researchers have discovered that the authenticated encryption portion of the current SSH Transport Protocol is vulnerable to several attacks.
ja: 現在のSSHトランスポートプロトコルの認証された暗号化部分がいくつかの攻撃に脆弱であることを研究者が発見した.

source: The Secure Shell Transport Model provides the following Abstract Service Interface (ASI) to describe the data passed between the SSH Transport Model and the SSH service.
ja: セキュアシェルトランスポートモデルは, SSH トランスポートモデルとSSHサービスの間で渡されるデータを記述するために, 次の Abstract Service Interface (ASI) を提供する.

source: compatibility with older, undocumented versions of this protocol may want to process the identification string without expecting the presence of the carriage return character for reasons described in Section 5 of this document.
ja: このプロトコルの文書化されていないさらに古いバージョンとの互換性を維持したい実装者は, この文書の5節で記述する理由からキャリッジリターンが存在しなくても識別文字列の処理をしたいだろう.

source: IANA Considerations .............................................6 6.
ja: IANA の考慮 .............................................6 6.

source: To do this, it defines a family of key exchange methods, two user authentication methods, and a new host key algorithm.
ja: このために, 鍵交換法のファミリと2つのユーザ認証法, 新しいホスト鍵アルゴリズムを定義する.

source: C generates a random number x (1 < x < q) and computes e = g^x mod p.
ja: C は, 乱数 x (1 < x < q) を生成し, e = g^x mod p を計算する.

source: o Initial IV server to client: HASH(K || H || "B" || session_id)
ja: o サーバからクライアントへの初期 IV: HASH(K || H || "B" || session_id)

source: If the value of this attribute is empty, all "tcpip-forward" requests should be refused when using this key.
ja: この属性の値が空なら, この鍵を用いるすべての "tcpip-forward" 要求は拒否される必要がある.

source: Other transport security protocols such as TLS support a session-resumption feature that allows reusing a cached session key.
ja: TLSのような他のトランスポートセキュリティプロトコルは, キャッシュされたセッション鍵を再利用することでセッション再開機能をサポートしている.

source: The second example is a standard password authentication; in this case, the user's password is expired.
ja: 2つ目の例は, 標準的なパスワード認証だ. この場合ユーザのパスワードの期限が切れている.

source: IANA Considerations .............................................5 4.1.
ja: IANA の考慮 .............................................5 4.1.

source: Table of Contents
ja: 目次

source: In the compatibility mode, the server MUST NOT send additional data before the identification string.
ja: この互換モードでは, サーバは識別文字列の前に追加の文字列を送ってはならない.

source: This is implemented using the following messages.
ja: これは, 次のメッセージ群を用いて実装される.

source: Key Format
ja: 鍵のフォーマット

source: The SSH Transport Model has no mechanisms by which it can test whether an underlying SSH connection provides auth or priv, so the SSH Transport Model trusts that the underlying SSH connection has been properly configured to support authPriv security characteristics.
ja: SSH Transport Model は, 基底の SSH 接続が認証やプライバシーを提供するかどうかをテストできるメカニズムを持たない. よって, SSH トランスポートモデルは, 基底の SSH 接続が authPriv セキュリティ特性をサポートするよう適切に設定されていることを信用する.

source: A higher level protocol for user authentication can be designed on top of this protocol.
ja: ユーザ認証のためのより高レベルのプロトコルが, このプロトコルの上で設計される.

source: Old Client, New Server
ja: 古いクライアントで新しいサーバ

source: In this scenario, it is important to verify that the public key provided by the server is indeed the server's public key.
ja: このシナリオでは, サーバから提供された公開鍵が本当にサーバの公開鍵か確認するのが重要だ.

source: Requests for assignments of new SSH_MSG_CHANNEL_OPEN 'reason code' values (and associated 'description' text) in the range of 0x00000005 to 0xFDFFFFFF MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 新しいSSH_MSG_CHANNEL_OPENの 'reason code' の値(と関連する 'description' テキスト) を割り当てる要求は, 0x00000005 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS におってされなければならない.

source: Users and administrators should, as a matter of course, use appropriate X11 security mechanisms to prevent unauthorized use of the X11 server.
ja: ユーザと管理者は, もちろん, X11サーバの不正な利用を防ぐために適切になX11のセキュリティメカニズムを利用しなけければならない.

source: This algorithm is used when, as a matter of configuration, the host does not have or does not wish to use a public key.
ja: 設定の問題として, ホストが公開鍵を持っていないか公開鍵の利用を望まない場合に, このアルゴリムは利用される.

source: If there is a session that matches the tmTransportAddress and tmSecurityName, then select that session.
ja: tmTransportAddress と tmSecurityName に一致するセッションがあれば, そのセッションを選択する.

source: Each tunnel is encrypted, and a message authentication code is used to ensure data integrity.
ja: どちらのチャンネルも, 暗号化され, データ完全性を保証するためにメッセージ認証コードが用いられる.

source: This means that short-lived sessions become computationally expensive compared to USM, which does not have a notion of a session key.
ja: これは, セッション鍵の概念のない USM 比べて, 短寿命のセッションが計算の負荷を生じることを意味している.

source: This document describes additional encryption methods and recommendations for the SSH Transport Protocol [RFC4253].
ja: この文書は, SSH トランスポートプロトコル [RFC4253] への新しい暗号法と推薦を記述している.

source: In addition to stateful-decryption counter mode, [BKN1,BKN2] describe other provably secure encryption methods for use with the SSH Transport Protocol.
ja: ステートフル-復号カウンターモードに加えて, [BKN1,BNK2]は, SSHトランスポートプロトコルで利用するためのおそらく安全と思われる別の暗号法を記述している.

source: Exiting the NETCONF Subsystem
ja: NETCONF サブシステムの終了

source: Some additional guidance for this is given in [RFC3766].
ja: さらなる助言が [RFC3766]で与えられている.

source: If the SSH Transport Model is configured to utilize AAA services, operators should consider configuring support for local authentication mechanisms, such as local passwords, so SNMP can continue operating during times of network stress.
ja: SSH トランスポートモデルが AAA サービスを利用するように設定されている場合は, 運用者は, ローカルパスワードのようなローカルの認証メカニズムのサポートの設定を考慮すべきだ. こうすると, SNMP はネットワークに負荷が掛っている時間帯に運用を続けることができる.

source: This document defines the following new public key algorithms for use in the Secure Shell protocol: x509v3-ssh-dss, x509v3-ssh-rsa, x509v3-rsa2048-sha256, and the family of algorithms given by x509v3-ecdsa-sha2-*.
ja: この文書は, セキュアシェルプロトコルで利用するための以下の新しい公開鍵アルゴリズムを定義する: x509v3-ssh-dss, x509v3-ssh-rsa, x509v3-rsa2048-sha256, x509v3-ecdsa-sha2-* で与えられるアルゴリズムのファミリー.

source: AES-GCM is prohibited from returning any portion of the plaintext until the authentication tag has been validated.
ja: AES-GCM は, 認証タグが検証されるまで平文を一部でも返すことを禁じられている.

source: The user name may be an empty string if it can be deduced from the results of the GSS-API authentication.
ja: GSS-APIの結果からユーザ名が推定できる場合は， ユーザ名は空文字列でもよい．

source: In particular, the list is not constrained by what was negotiated during key exchange.
ja: 特に, 鍵交換の際に交渉されたリストに縛られなくてもよい.

source: This is not a significant problem, since in the configuration described, it will also be unable to interoperate with implementations that do not support the GSS-API-authenticated key exchange and Kerberos.
ja: これは重大な問題ではない. 前述した設定では, GSS-API で認証された 鍵交換と Kerberos をサポートしていない実装と相互運用できないからだ.

source: Extended Channel Data Transfer data_type_code and Data
ja: 拡張チャンネルデータ転送の data_type_code と data

source: Authentication Protocol Message Numbers
ja: 認証プロトコルのメッセージ番号

source: SSH sessions are uniquely identified within the SSH Transport Model by the combination of tmTransportAddress and tmSecurityName associated with each session.
ja: それぞれのセッションに関連する tmTransportAddress と tmSecurityName の組合せで SSH トランスポートモデルの中で SSH のセッションはユニークに識別される.
